app/views/books/_form.html.erb

SELECT `authors`.* FROM `authors`
---
  </div>
  <%= f.select :author_id, options_for_select(Author.all.collect {|auth| [auth.name, auth.id]}, :selected => @book.author_id), {:include_blank => 'Select Author'}, :class => 'text_field', :id => "book_subject" %>