app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors" WHERE "authors"."unique_name" IS NULL LIMIT 1
---
  def show
    @author = Author.find_by_unique_name(params[:id])

INSERT INTO "authors" ("age", "created_at", "name", "unique_name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["age", 1], ["created_at", Fri, 09 May 2014 05:57:26 UTC +00:00], ["name", "fds"], ["unique_name", nil], ["updated_at", Fri, 09 May 2014 05:57:26 UTC +00:00]]
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save