app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."title" = 'sdfa' LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", "1-encyclopedia"]]
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
  def show

    @book = Book.find_by_title(params[:id])
    @a = @book.author_id
    @boksu=Book.find(:all,:conditions => ['author_id IN (?)',@a] )

INSERT INTO "books" ("author_id", "created_at", "desc", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 4], ["created_at", Fri, 09 May 2014 07:02:01 UTC +00:00], ["desc", "good one"], ["title", "encyclopedia"], ["updated_at", Fri, 09 May 2014 07:02:01 UTC +00:00]]
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", "5-sad"]]
UPDATE "books" SET "author_id" = NULL, "updated_at" = '2014-05-09 07:32:19.654935' WHERE "books"."id" = 5
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])